import './aboutUs.css'

export default function AboutUs() {
  return (
    <section className="aboutUs">
      <div className="container">
        <h1>HV_Garage — Експертна інженерія вашого автомобіля</h1>
        <p className="aboutUs__desc">
          HV_Garage — це не просто сервіс, а високотехнологічний хаб для
          автовласників, які цінують інтелектуальний підхід до обслуговування
          авто. Ми спеціалізуємося на складній електроніці, програмуванні та
          комплексному оснащенні автомобілів якісними компонентами.
        </p>

        <h1>Наша спеціалізація</h1>
        <ul className="aboutUs__list">
          <li className="aboutUs__list__item">
            Інтелектуальні рішення: Від діагностики та ремонту електропроводки
            до професійного чип-тюнінгу та складного програмування систем.
          </li>
          <li className="aboutUs__list__item">
            Власний склад запчастин: Вам не потрібно чекати тижнями — широкий
            асортимент комплектуючих завжди в наявності для швидкого сервісу.
          </li>
          <li className="aboutUs__list__item">
            Світло та звук: Ми є постачальниками передового автосвітла
            (LED/Bi-Led лінзи) та преміальної акустики від провідних брендів,
            таких як KRS, Cyclone, Decker та Kicx.
          </li>
          <li className="aboutUs__list__item">
            Ремонт електроніки: Відновлюємо працездатність найскладніших блоків
            керування та мультимедійних систем.
          </li>
        </ul>

        <h1>Чому обирають нас</h1>
        <ol className="aboutUs__list">
          <li className="aboutUs__list__item">
            Точність: Використовуємо дилерське обладнання для діагностики та
            програмування.
          </li>
          <li className="aboutUs__list__item">
            Якість компонентів: Ми ретельно відбираємо асортимент — від
            перехідних рамок до потужних сабвуферів та відеореєстраторів.
          </li>
          <li className="aboutUs__list__item">
            Комплексний підхід: Ви можете одночасно оновити світло, встановити
            камеру заднього огляду та зробити програмне налаштування двигуна в
            одному боксі.
          </li>
        </ol>
      </div>
    </section>
  );
}
